<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"d16f9018a3db00347ae935301d0ce4e17756d06551c9900c7ab3aa31ae5f45db","plan_job_ref":"Job Create terraform plan #7 at https://github.com/Toxma/SDV-IAC-AWS/actions/runs/13812790685","plan_out_hash":"ab4fc2910092188d1e468b892f877e7b3c2ac8a804c5bc4d73574f4f73191c50","plan_hash":"048a565c05e6a85ab52ebb2577397dd614e10b358e983a66f7cfa9471f76c7bc","plan_text_format":"diff","version":"1.47.0"} -->
Terraform plan in __phase6-7/terraform__
<details>
<summary>Plan: 1 to add, 1 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_service.app-service will be updated in-place
!~  resource "aws_ecs_service" "app-service" {
        id                                 = "arn:aws:ecs:us-east-1:211125526652:service/example-university-prod-ecs/example-university-prod-app"
        name                               = "example-university-prod-app"
        tags                               = {}
!~      task_definition                    = "arn:aws:ecs:us-east-1:211125526652:task-definition/example-university-prod-app:2" -> (known after apply)
#        (16 unchanged attributes hidden)

#        (4 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.app-task must be replaced
-/+ resource "aws_ecs_task_definition" "app-task" {
!~      arn                      = "arn:aws:ecs:us-east-1:211125526652:task-definition/example-university-prod-app:2" -> (known after apply)
!~      arn_without_revision     = "arn:aws:ecs:us-east-1:211125526652:task-definition/example-university-prod-app" -> (known after apply)
!~      container_definitions    = jsonencode(
!~          [
!~              {
!~                  environment      = [
#                        (2 unchanged elements hidden)
                        {
                            name  = "APP_DB_PASSWORD"
                            value = "student12"
                        },
!~                      {
                            name  = "APP_DB_USER"
!~                          value = "nodeapp" -> "root"
                        },
                        {
                            name  = "APP_PORT"
                            value = "80"
                        },
-                       {
-                           name  = "INIT_DB_USER"
-                           value = "root"
                        },
                    ]
-                   mountPoints      = []
                    name             = "example-university-prod-app"
!~                  portMappings     = [
!~                      {
-                           protocol      = "tcp"
#                            (2 unchanged attributes hidden)
                        },
                    ]
-                   systemControls   = []
-                   volumesFrom      = []
#                    (4 unchanged attributes hidden)
                },
            ] # forces replacement
        )
!~      enable_fault_injection   = false -> (known after apply)
!~      id                       = "***************************" -> (known after apply)
!~      revision                 = 2 -> (known after apply)
-       tags                     = {} -> null
#        (12 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Create terraform plan #7](https://github.com/Toxma/SDV-IAC-AWS/actions/runs/13812790685)